import { shuffle } from "lodash";

export interface ExcuseType {
  text: string;
  isClassic?: boolean;
  isExcellent?: boolean;
}

export const excusesList: ExcuseType[] = shuffle([
  { text: "אני בציפורלה הערב", isExcellent: true },
  { text: "עוזר לחבר להרכיב סטנד לקלידים, לא בטוח שאספיק" },
  {
    text: "רואה פגוש את העיתונות עם ההורים ואצא אחרי",
    isClassic: true,
    isExcellent: true,
  },
  { text: "קושר שרוכים ויוצא אליך", isClassic: true },
  { text: "מקליט היום תפקידי נשיפה לכל האלבום", isClassic: true },
  { text: "אני בפסטיבל מוזיקה במדריד היום" },
  { text: "בהקלטה של האלבום של פנחס ובניו, לא אספיק" },
  { text: "לא חושב שאספיק, שידור בערוץ הספורט הערב" },
  {
    text: "הבטחתי לאבא לעזור עם הרצאה הערב במועדון",
    isClassic: true,
    isExcellent: true,
  },
  { text: "מופיע הערב עם ההרכב מחווה לארקטיק מאנקיז, מוזמן!" },
  { text: "שבור אחרי ריצה וסמבוסק" },
  { text: "במשחק של הפועל הערב" },
  {
    text: "מקווה שאספיק אחרי המשחק של הפועל הערב, נראה לקראת",
    isClassic: true,
  },
  { text: "יש השבוע ישיבה של חברים מהעמק אחרי הרבה זמן" },
  {
    text: "יש השבוע ישיבה של חברים מהעמק אחרי הרבה זמן",
    isExcellent: true,
    isClassic: true,
  },
  { text: "יש לי כרטיסים בחמישי הבא לאלון עדר בבית האופרה" },
  { text: "יוסי מרשק גנב ממני בלון כרגע, מעכל", isExcellent: true },
  { text: "התפוצץ לי המוח מווסטוורלד, לא חושב שאצא הערב" },
  { text: "תקוע בעמק בלי רכב הערב" },
  { text: "אני שיפט בעבודה היום אבל אביא את המחשב", isClassic: true },
  { text: "מקווה להספיק, אני עובד על שאלות לערב טריוויה בעבודה" },
  { text: "אני במו״מ עם הסוכנות של בילי ג׳ואל על זכויות", isExcellent: true },
  { text: "מסיים לחרבן ויוצא, חצי שעה ככה", isClassic: true },
  { text: "הערב בחנוכת דירה בת״א" },
  { text: "יש לי כרטיסים לעיר הזאת ברוסית פעם שלישית השבוע", isClassic: true },
  { text: "אני מחפש תחנת דלק עם גז רגע ויוצא" },
  { text: "משלים הרשימה השחורה עם ההורים, לא אוכל היום" },
  { text: "אני בהקרנה מורחבת של לה לה לנד ביפו היום", isClassic: true },
  { text: "אני חוגג פסח במסיבת פורים במונש הערב" },
  { text: "אני ביום שליחת הודעות חג שמח, לא אספיק", isClassic: true },
]);
